package ua.com.glybovets.java1_1.lecture8;

import acm.program.ConsoleProgram;
/*
візьміть позитивне ціле число, назвемо його n
якщо n парне, поділимо його на 2
якщо n не парне, помножимой його на 3 і додамо 1
продовжувати цей процес поки n не буде дорівнювати 1

Напишіть програму, що реалізує вказаний алгоритм і наочно проілюструє його виконання. В кінці обов'язково повідомити кількість кроків.
*/
public class L16PairThreeOne extends ConsoleProgram{
		
	public void run() {
		
		println ("якщо n парне, поділимо його на 2");
		println ("якщо n не парне, помножимой його на 3 і додамо 1");
		println ("продовжувати цей процес поки n не буде дорівнювати 1");
		
		int n=readInt("Введіть число n: ");
		int count=0;
		
		while (n!=1) {
			count++;
			if (n%2==0){
				n/=2;
				println ("крок ("+count+"): n парне, поділимо його на 2 : "+n);
			}
			else {
				n=n*3+1;
				println ("крок ("+count+"): n не парне, помножимой його на 3 і додамо 1 : "+n);
			}
		}
		println ("Число n було зведено до 1 за "+count+" кроків");
	}
}
